pillo79/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/hal/nrf_nfct.h
/**
 * @brief Function for setting up the NFC frame reception.
 *
 * @note Destination for the received data is set using @ref nrf_nfct_rxtx_buffer_set.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] flags NFCT RX configuration flags. Use @ref nrf_nfct_rx_frame_config_t for setting
 *                  the desired configuration.
 */
NRF_STATIC_INLINE void nrf_nfct_rx_frame_config_set(NRF_NFCT_Type * p_reg, uint8_t flags);

/**
 * @brief Function for getting the number of bits received from the NFC poller.
 *
 * @param[in] p_reg        Pointer to the structure of registers of the peripheral.
 * @param[in] crc_excluded Flag for excluding CRC size from calculation.
 *
 * @return Number of received bits including or excluding CRC, and excluding parity
 *         and SoF/EoF framing.
 */
NRF_STATIC_INLINE uint16_t nrf_nfct_rx_bits_get(NRF_NFCT_Type const * p_reg, bool crc_excluded);

/**
 * @brief Function for getting the NFCID1 (NFC tag identifier).
 *
 * @note This function always returns the full configuration of the NFCID1 setting (10 bytes),
 *       regardless of the NFCID1 size. The NFCID1 size can be configured using
 *       @ref nrf_nfct_sensres_nfcid1_size_set or @ref nrf_nfct_nfcid1_set.
 *
 * @param[in]  p_reg        Pointer to the structure of registers of the peripheral.
 * @param[out] p_nfcid1_buf Pointer to a buffer for the NDFCID1 parameter.
 *                          The NFCID1 values are in little endian order,
 *                          that is: |NFCID1_3RD_LAST|NFCID1_2ND_LAST|NFCID1_LAST|.
 *
 * @return Configured NFCID1 length
 */
NRF_STATIC_INLINE
nrf_nfct_sensres_nfcid1_size_t nrf_nfct_nfcid1_get(NRF_NFCT_Type const * p_reg,
                                                   uint8_t *             p_nfcid1_buf);

/**
 * @brief Function for setting the NFCID1 (NFC tag identifier).
 *
 * @note This function also configures the NFCIDSIZE field in the SENSRES
 *       register of the NFCT peripheral.
 *
 * @param[in] p_reg        Pointer to the structure of registers of the peripheral.
 * @param[in] p_nfcid1_buf Pointer to the buffer with NDFCID1 bytes.
 * @param[in] nfcid1_size  Size of the NFCID1 in bytes.
 */
NRF_STATIC_INLINE void nrf_nfct_nfcid1_set(NRF_NFCT_Type *                p_reg,
                                           uint8_t const *                p_nfcid1_buf,
                                           nrf_nfct_sensres_nfcid1_size_t nfcid1_size);

#if NRF_NFCT_HAS_AUTOCOLRES_CONFIG_REG
/**
 * @brief Function for getting the setting for the automatic collision resolution.
 *
 * @details The automatic collision resolution mechanism as defined in ISO 14443-3 and NFC Forum
 *          Digital Protocol Technical Specification 2.0, section 6.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 *
 * @retval true  If automatic collision resolution is enabled.
 * @retval false If automatic collision resolution is disabled.
 */
NRF_STATIC_INLINE bool nrf_nfct_autocolres_is_enabled(NRF_NFCT_Type const * p_reg);

/**
 * @brief Function for enabling the automatic collision resolution.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 *
 * @details The automatic collision resolution mechanism as defined in ISO 14443-3 and NFC Forum
 *          Digital Protocol Technical Specification 2.0, section 6.
 */
NRF_STATIC_INLINE void nrf_nfct_autocolres_enable(NRF_NFCT_Type * p_reg);

/**
 * @brief Function for disabling the automatic collision resolution.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 *
 * @details The automatic collision resolution mechanism as defined in ISO 14443-3 and NFC Forum
 *          Digital Protocol Technical Specification 2.0, section 6.
 */
NRF_STATIC_INLINE void nrf_nfct_autocolres_disable(NRF_NFCT_Type * p_reg);
#endif // NRF_NFCT_HAS_AUTOCOLRES_CONFIG_REG

/**
 * @brief Function for getting the NFCID1 size from the SENS_RES frame configuration.
 *
 * @details The SENS_RES frame is handled automatically by the NFCT hardware.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 *
 * @return NFCID1 (tag identifier) size.
 */
NRF_STATIC_INLINE
nrf_nfct_sensres_nfcid1_size_t nrf_nfct_sensres_nfcid1_size_get(NRF_NFCT_Type const * p_reg);

/**
 * @brief Function for setting the NFCID1 (tag identifier) size.field in the SENS_RES frame
 *        configuration.
 *
 * @note The SENS_RES frame is handled automatically by the NFCT hardware.
 *
 * @param[in] p_reg       Pointer to the structure of registers of the peripheral.
 * @param[in] nfcid1_size NFCID1 (tag identifier) size.
 *
 * @sa nrf_nfct_nfcid1_set()
 */
NRF_STATIC_INLINE
void nrf_nfct_sensres_nfcid1_size_set(NRF_NFCT_Type *                p_reg,
                                      nrf_nfct_sensres_nfcid1_size_t nfcid1_size);

/**
 * @brief Function for getting the Bit Frame SDD field from the SENS_RES frame configuration.
 *
 * @details The SENS_RES frame is handled automatically by the NFCT hardware.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 *
 * @return The Bit Frame SDD field configuration.
 */
NRF_STATIC_INLINE
nrf_nfct_sensres_bit_frame_sdd_t nrf_nfct_sensres_bit_frame_sdd_get(NRF_NFCT_Type const * p_reg);

/**
 * @brief Function for setting the Bit Frame SDD field in the SENS_RES frame configuration.
 *
 * @note The SENS_RES frame is handled automatically by the NFCT hardware.
 *
 * @param[in] p_reg         Pointer to the structure of registers of the peripheral.
 * @param[in] bit_frame_sdd The Bit Frame SDD field configuration.
 */
NRF_STATIC_INLINE
void nrf_nfct_sensres_bit_frame_sdd_set(NRF_NFCT_Type *                  p_reg,
                                        nrf_nfct_sensres_bit_frame_sdd_t bit_frame_sdd);

/**
 * @brief Function for getting the Platform Config field from the SENS_RES frame configuration.
 *
 * @details The SENS_RES frame is handled automatically by the NFCT hardware.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 *
 * @return The Platform Config field configuration.
 */
NRF_STATIC_INLINE nrf_nfct_sensres_platform_config_t
nrf_nfct_sensres_platform_config_get(NRF_NFCT_Type const * p_reg);

/**
 * @brief Function for setting the Platform Config field in the SENS_RES frame configuration.
 *
 * @note The SENS_RES frame is handled automatically by the NFCT hardware.
 *
 * @param[in] p_reg           Pointer to the structure of registers of the peripheral.
 * @param[in] platform_config The Platform Config field configuration.
 */
NRF_STATIC_INLINE
void nrf_nfct_sensres_platform_config_set(NRF_NFCT_Type *                    p_reg,
                                          nrf_nfct_sensres_platform_config_t platform_config);

/**
 * @brief Function for checking the CASCADE bit of the SEL_RES frame.
 *
 * @details The CASCADE bit in the SEL_RES register is handled automatically by the NFCT hardware
 *          and indicates the status of the NFCID1 read operation to the NFC poller according to
 *          the NFC Forum Digital Protocol Speficiation 2.0, section 6.8.2.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 *
 * @retval true  If NFCID1 read procedure is not complete.
 * @retval false If NFCID1 read procedure is complete.
 */
NRF_STATIC_INLINE bool nrf_nfct_selres_cascade_check(NRF_NFCT_Type const * p_reg);

/**
 * @brief Function for getting the Protocol field in the SEL_RES frame.
 *
 * @details The SEL_RES frame is handled automatically by the NFCT hardware.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 *
 * @return Value of the Protocol field in the SEL_RES frame.
 */
NRF_STATIC_INLINE
nrf_nfct_selres_protocol_t nrf_nfct_selres_protocol_get(NRF_NFCT_Type const * p_reg);

/**
 * @brief Function for setting the Protocol field in the SEL_RES frame configuration.
 *
 * @details The SEL_RES frame is handled automatically by the NFCT hardware.
 *
 * @param[in] p_reg            Pointer to the structure of registers of the peripheral.
 * @param[in] sel_res_protocol Value of the Protocol field in the SEL_RES frame.
 */
NRF_STATIC_INLINE void nrf_nfct_selres_protocol_set(NRF_NFCT_Type *            p_reg,
                                                    nrf_nfct_selres_protocol_t sel_res_protocol);

/**
 * @brief Function for getting the SEL_RES frame configuration.
 *
 * @details The SEL_RES frame is handled automatically by the NFCT hardware.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 *
 * @return SEL_RES frame configuration.
 */
NRF_STATIC_INLINE uint32_t nrf_nfct_selres_get(NRF_NFCT_Type const * p_reg);

/**
 * @brief Function for setting the SEL_RES frame configuration.
 *
 * @details The SEL_RES frame is handled automatically by the NFCT hardware.
 *
 * @param[in] p_reg  Pointer to the structure of registers of the peripheral.
 * @param[in] selres SEL_RES frame configuration.
 */
NRF_STATIC_INLINE void nrf_nfct_selres_set(NRF_NFCT_Type * p_reg, uint32_t selres);

#if NRF_NFCT_HAS_PAD_CONFIG_REG
/**
 * @brief Function for enabling or disabling the NFC pad configuration.
 *
 * @details When the NFC pads are enabled, they are configured as the NFC
 *          antenna pins, and the NFC pins protection mechanism is enabled.
 *          When the NFC pads are disabled, they are configured as GPIO pins.
 *
 * @param[in] p_reg  Pointer to the structure of registers of the peripheral.
 * @param[in] enable True if the NFC pads are to be enabled, false otherwise.
 */
NRF_STATIC_INLINE void nrf_nfct_pad_config_enable_set(NRF_NFCT_Type * p_reg, bool enable);

/**
 * @brief Function for checking the NFC pads configuration.
 *
 * @details When the NFC pads are enabled, they are configured as the NFC
 *          antenna pins, and the NFC pins protection mechanism is enabled.
 *          When the NFC pads are disabled, they are configured as GPIO pins.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 *
 * @retval true  NFC pads are enabled.
 * @retval false NFC pads are disabled.
 */
NRF_STATIC_INLINE bool nrf_nfct_pad_config_enable_check(NRF_NFCT_Type const * p_reg);
#endif // NRF_NFCT_HAS_PAD_CONFIG_REG

#if NRF_NFCT_HAS_BIAS_CONFIG_TRIM_REG
/**
 * @brief Function for setting the bias configuration.
 *
 * @param[in] p_reg         Pointer to the structure of registers of the peripheral.
 * @param[in] p_bias_config Pointer to the structure of bias configuration parameters.
 */
NRF_STATIC_INLINE void nrf_nfct_bias_config_set(NRF_NFCT_Type *                p_reg,
                                                nrf_nfct_bias_config_t const * p_bias_config);

/**
 * @brief Function for getting the bias configuration.
 *
 * @param[in] p_reg         Pointer to the structure of registers of the peripheral.
 * @param[in] p_bias_config Pointer to the structure to be filled with bias configuration parameters.
 */
NRF_STATIC_INLINE void nrf_nfct_bias_config_get(NRF_NFCT_Type const *    p_reg,
                                                nrf_nfct_bias_config_t * p_bias_config);
#endif // NRF_NFCT_HAS_BIAS_CONFIG_TRIM_REG

#ifndef NRF_DECLARE_ONLY
NRF_STATIC_INLINE void nrf_nfct_task_trigger(NRF_NFCT_Type * p_reg, nrf_nfct_task_t task)
{
    *((volatile uint32_t *)((uint8_t *)p_reg + (uint32_t)task)) = 1UL;
}

