pillo79/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/hal/nrf_nfct.h
NRF_STATIC_INLINE void nrf_nfct_selres_protocol_set(NRF_NFCT_Type *            p_reg,
                                                    nrf_nfct_selres_protocol_t sel_res_protocol)
{
    p_reg->SELRES = (p_reg->SELRES & ~NFCT_SELRES_PROTOCOL_Msk) |
                    ((uint32_t)sel_res_protocol << NFCT_SELRES_PROTOCOL_Pos);
}

NRF_STATIC_INLINE uint32_t nrf_nfct_selres_get(NRF_NFCT_Type const * p_reg)
{
    return p_reg->SELRES;
}

NRF_STATIC_INLINE void nrf_nfct_selres_set(NRF_NFCT_Type * p_reg, uint32_t selres)
{
    p_reg->SELRES = (p_reg->SELRES & NFCT_SELRES_CASCADE_Msk) | (selres & ~NFCT_SELRES_CASCADE_Msk);
}

#if NRF_NFCT_HAS_PAD_CONFIG_REG
NRF_STATIC_INLINE void nrf_nfct_pad_config_enable_set(NRF_NFCT_Type * p_reg, bool enable)
{
    p_reg->PADCONFIG = (enable ?
                        NFCT_PADCONFIG_ENABLE_Enabled :
                        NFCT_PADCONFIG_ENABLE_Disabled) <<
                       NFCT_PADCONFIG_ENABLE_Pos;
}

NRF_STATIC_INLINE bool nrf_nfct_pad_config_enable_check(NRF_NFCT_Type const * p_reg)
{
    return (bool)(((p_reg->PADCONFIG & NFCT_PADCONFIG_ENABLE_Msk) >> NFCT_PADCONFIG_ENABLE_Pos));
}
#endif // NRF_NFCT_HAS_PAD_CONFIG_REG

#if NRF_NFCT_HAS_BIAS_CONFIG_TRIM_REG
NRF_STATIC_INLINE void nrf_nfct_bias_config_set(NRF_NFCT_Type *                p_reg,
                                                nrf_nfct_bias_config_t const * p_bias_config)
{
    NRFX_ASSERT(p_bias_config != NULL);

    p_reg->BIASCFG = (((p_bias_config->trim_ibpsr <<
                        NFCT_BIASCFG_TRIMIBPSR_Pos) &
                       NFCT_BIASCFG_TRIMIBPSR_Msk) |
                      ((p_bias_config->coarse_ibpsr <<
                        NFCT_BIASCFG_COARSEIBPSR_Pos) &
                       NFCT_BIASCFG_COARSEIBPSR_Msk) |
                      ((p_bias_config->reference_volatge <<
                        NFCT_BIASCFG_REFERENCEVOLTAGE_Pos) &
                       NFCT_BIASCFG_REFERENCEVOLTAGE_Msk) |
                      ((p_bias_config->spare <<
                        NFCT_BIASCFG_SPARE_Pos) &
                       NFCT_BIASCFG_SPARE_Msk));
}

NRF_STATIC_INLINE void nrf_nfct_bias_config_get(NRF_NFCT_Type const *    p_reg,
                                                nrf_nfct_bias_config_t * p_bias_config)
{
    NRFX_ASSERT(p_bias_config != NULL);

    p_bias_config->trim_ibpsr = (p_reg->BIASCFG & NFCT_BIASCFG_TRIMIBPSR_Msk)
                                >> NFCT_BIASCFG_TRIMIBPSR_Pos;

    p_bias_config->coarse_ibpsr = (p_reg->BIASCFG & NFCT_BIASCFG_COARSEIBPSR_Msk)
                                  >> NFCT_BIASCFG_COARSEIBPSR_Pos;

    p_bias_config->reference_volatge = (p_reg->BIASCFG & NFCT_BIASCFG_REFERENCEVOLTAGE_Msk)
                                       >> NFCT_BIASCFG_REFERENCEVOLTAGE_Pos;

    p_bias_config->spare = (p_reg->BIASCFG & NFCT_BIASCFG_SPARE_Msk)
                           >> NFCT_BIASCFG_SPARE_Pos;
}
#endif // NRF_NFCT_HAS_BIAS_CONFIG_TRIM_REG

#endif /* NRF_DECLARE_ONLY */

/** @} */

#ifdef __cplusplus
}
#endif

#endif /* NRF_NFCT_H__ */
